---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.JoistSystemNumBeamsSameType
source: html/f77d830c-a988-aa9e-2519-50c28d2e2208.htm
---
# Autodesk.Revit.DB.ParameterTypeId.JoistSystemNumBeamsSameType Property

"Num. of Beams With Same Type"

## Syntax (C#)
```csharp
public static ForgeTypeId JoistSystemNumBeamsSameType { get; }
```